---
kind: method
id: M:Autodesk.Revit.DB.CurveArrArray.Insert(Autodesk.Revit.DB.CurveArray,System.Int32)
source: html/9d2e3d97-bcbe-b895-8d2c-c62f2f238010.htm
---
# Autodesk.Revit.DB.CurveArrArray.Insert Method

## Syntax (C#)
```csharp
public virtual void Insert(
	CurveArray item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.CurveArray`)
- **index** (`System.Int32`)